In [4]:
# Importing numpy and pandas
import numpy as np
import pandas as pd

## <center>Pandas Dataframe </center>

In [37]:
# creating pandas dataframe from python dictinoary
scores = {
    "names": ['Rojit', 'Mark', 'Elon', 'bill', 'Larry'],
    "city": ['Toronto', 'California', 'Los Angeles', 'NY','DC'],
    "score": [79, 67, 49, 88, 48]
}
df = pd.DataFrame(scores)
df

   names         city  score
0  Rojit      Toronto     79
1   Mark   California     67
2   Elon  Los Angeles     49
3   bill           NY     88
4  Larry           DC     48

In [38]:
# get only names from dataframe
print(df['names'])
print(type(df['names']))  #  it returns a pandas series

0    Rojit
1     Mark
2     Elon
3     bill
4    Larry
Name: names, dtype: object
<class 'pandas.core.series.Series'>

In [39]:
# create new column in pandas dataframe
df['name_city']= df['names']+ ', '+df['city']
df

   names         city  score          name_city
0  Rojit      Toronto     79     Rojit, Toronto
1   Mark   California     67   Mark, California
2   Elon  Los Angeles     49  Elon, Los Angeles
3   bill           NY     88           bill, NY
4  Larry           DC     48          Larry, DC

## <center> Filtering dataframe </center>

In [40]:
# Returning series with score greater than 50 only
df['score'] > 50

0     True
1     True
2    False
3     True
4    False
Name: score, dtype: bool

In [41]:
condition = df['score'] > 50  # same as previous cell
# passing the same condition to dataframe to filter out the rows which return true
df[condition]

   names        city  score         name_city
0  Rojit     Toronto     79    Rojit, Toronto
1   Mark  California     67  Mark, California
3   bill          NY     88          bill, NY

##  <center>Basic dataframe methods and attributes</center>

In [47]:
# use head to inspect top rows of the dataframe, pass int arguments or 5 is default
df.head(2)

   names        city  score         name_city
0  Rojit     Toronto     79    Rojit, Toronto
1   Mark  California     67  Mark, California

In [48]:
# tail to inspect bottom
df.tail(3)

   names         city  score          name_city
2   Elon  Los Angeles     49  Elon, Los Angeles
3   bill           NY     88           bill, NY
4  Larry           DC     48          Larry, DC

In [49]:
# returns data type of each columns
df.dtypes

names        object
city         object
score         int64
name_city    object
dtype: object

In [51]:
# returns shape of dataframe -> rows, cols
df.shape

(5, 4)

## <center>Subsetting data </center>

In [58]:
# using loc
# returns row from index 2 to 4
df.loc[2:5]

   names         city  score          name_city
2   Elon  Los Angeles     49  Elon, Los Angeles
3   bill           NY     88           bill, NY
4  Larry           DC     48          Larry, DC

In [67]:
# using key from 0 index to retrive data
df.loc[0,'names'], df.loc[0,'city']

('Rojit', 'Toronto')

In [68]:
# using iloc 
df.iloc[3, 0] , df.iloc[0, 0]

('bill', 'Rojit')